http_apps/request3.txt

<SOAP:Envelope xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/'><SOAP:Header/><SOAP:Body><ns0:updateWorkOrder xmlns:ns0='urn:aucklandcouncil.govt.nz:service:supplier:operations:componentmodel:order'><workOrderRequest><orderId>003101037842</orderId><orderType>ZPM1</orderType><workDescription>Awaiting appPROACTIVEMURDOCH PARKDAMAGED GATEGate leading to playing fields has been damaged/broken either re-welding or gate willneed to be replaced.</workDescription><status>APPR</status><priority>5</priority><activityType>INS</activityType><plannerGroup>AI5</plannerGroup><sequenceId>0000000010576419</sequenceId><mainWorkCentre>B2B_CF</mainWorkCentre><address>27R Chestnut Road | Papatoetoe</address><locationId>10598-L100-205</locationId><releaseDate>2018-04-11T00:28:48Z</releaseDate><lastUpdated>2018-04-11T00:28:49Z</lastUpdated><requiredStart>2018-04-25T00:28:00Z</requiredStart><requiredFinish>2018-04-25T00:28:00Z</requiredFinish><purchaseOrderId>6500086720</purchaseOrderId><purchaseOrderItemId>4</purchaseOrderItemId><estimatedCosts>        0.00</estimatedCosts><loggedXCoordinate>1764700.99</loggedXCoordinate><loggedYCoordinate>5904863.20</loggedYCoordinate><supplierOrderId>3315398</supplierOrderId><supplierId>901630</supplierId><operation><operationId>0010</operationId><workCentre>B2B_CF</workCentre><status>APPR</status><description>Awaiting appPROACTIVEMURDOCH PARKDAMAGED</description><locationId>10598-L100-205</locationId><service><serviceId>000000000003000171</serviceId><serviceQuantity>1.000</serviceQuantity><uom>AU</uom><plannedCost>460.00</plannedCost></service></operation><document><url>https%3A%2F%2Fsappo-qas-sys.aklc.govt.nz%2Faklc.govt.nz%7Edc%7Eaklc%7Eaklcarchivelink%2Farchivelink%3Fget%26pVersion%3D0046%26contRep%3DZE%26docId%3D005056BC18A81ED896C424B56DBAB42B</url><docid>005056BC18A81ED896C424B56DBAB42B</docid></document></workOrderRequest></ns0:updateWorkOrder></SOAP:Body></SOAP:Envelope>